In [2]:
# PANDAS: PYTHO DATA ANALYSIS LIBRARY
# 1.IT IS A OPEN SOURCE LIBRARY
#2.IT IS MAINLY USED FOR DATA MANUPULATION AND DATA ANALYSIS
# IT DEALS WITH THREE DIFFERENT STRUCTURES 
#     1.SERIES ->1.1-D
#     2.DATAFRAME ->2-D
#     3.PANNEL ->3-D

#HOW TO CREATE SERIES DATA STRUCTURES
    # Series:
    #   -from list,dictionary
    #   -numpy array

In [3]:
import pandas as pd

In [6]:
pd.__version__

'0.24.2'

In [ ]:
data=

In [ ]:
sd=pd.series(data,index=['A','B','C'])

In [4]:
data1={'name':'apssdc','roll':510,'branch':'ece'}
sd1=pd.Series(data1)
sd1

name      apssdc
roll         510
branch       ece
dtype: object

In [7]:
import numpy as np

In [8]:
sd3=pd.Series(np.array([10,20,30]),index=[1,2,3])
sd3

1    10
2    20
3    30
dtype: int32

In [51]:
data3={'name':['appssdc','irfan','roshan'],'roll':[510,320,309]}
df=pd.DataFrame(data3)
df

      name  roll
0  appssdc   510
1    irfan   320
2   roshan   309

In [40]:
df.columns

Index(['name', 'roll'], dtype='object')

In [41]:
df.values[1][0]

'irfan'

In [42]:
#add new row
df.loc[3]=['srit',420]
df

      name  roll
0  appssdc   510
1    irfan   320
2   roshan   309
3     srit   420

In [43]:
df.iloc[3]=['sr',430]
df

      name  roll
0  appssdc   510
1    irfan   320
2   roshan   309
3       sr   430

In [44]:
#to add a new column
df['branch']=['cse','ece','eee','mech']
df

      name  roll branch
0  appssdc   510    cse
1    irfan   320    ece
2   roshan   309    eee
3       sr   430   mech

In [45]:
#to delete a one specific row
df.drop(1,inplace=True)
df

      name  roll branch
0  appssdc   510    cse
2   roshan   309    eee
3       sr   430   mech

In [52]:
data3={'name':['ravi','pooja','pavithra','indu','kavya','lav'],'age':[20,30,40,50,60,70]}
df1=pd.DataFrame(data3)
df1

       name  age
0      ravi   20
1     pooja   30
2  pavithra   40
3      indu   50
4     kavya   60
5       lav   70

In [54]:
df1.head()

       name  age
0      ravi   20
1     pooja   30
2  pavithra   40
3      indu   50
4     kavya   60

In [55]:
df1.head(2)

    name  age
0   ravi   20
1  pooja   30

In [99]:
df1[df1['age']>20]

       name  age
1     pooja   30
2  pavithra   40
3      indu   50
4     kavya   60
5       lav   70

In [127]:
def ages(df1):
    for i in df1.name:
        if(i[0].startswith('p')):
            print(df1[df1['name']==i])
            return(df1[df1['name']==i])
ages((df1))

    name  age
1  pooja   30

    name  age
1  pooja   30

In [130]:
import pandas as pd 
  
# reading csv file from url  
data = pd.DataFrame(df1) 
  
# String to be searched in start of string  
search ="p"
  
# boolean series returned with False at place of NaN 
bool_series = data["name"].str.startswith(search, na = False) 
  
# displaying filtered dataframe 
data[bool_series]

       name  age
1     pooja   30
2  pavithra   40